app/controllers/fdboard_controller.rb

INSERT INTO "fdboards" ("user", "messages") VALUES ($1, $2) RETURNING "id"  [["user", "me"], ["messages", " hi"]]
---
	def start
		@title = 'Freedom Board!'
		@search=params['search']

		@message  = params['message']
		@user  = params['user']
		if(!@message.nil?)
		a = Fdboard.new
		a.user = @user+ " " + (Time.now.strftime("%m/%d/%Y %H:%M:%S"))
		a.messages = @message
		a.save!