app/views/fdboard/start.html.erb

SELECT  "fdboards".* FROM "fdboards" ORDER BY "fdboards"."id" ASC LIMIT ?  [["LIMIT", 1000]]
---
				<div id = "posts">
					<% Fdboard.find_in_batches do |u| %>