app/views/fdboard/start.html.haml

SELECT  "fdboards".* FROM "fdboards" ORDER BY "fdboards"."id" ASC LIMIT $1  [["LIMIT", 1000]]
---
          #posts
            - Fdboard.find_in_batches do |u|